searching-delimited-log-files.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Searching Delimited Log Files (alternatively, sed is black magic)</title>
<!-- 2015-01-07 Wed 21:02 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Josh" />
<link rel="stylesheet" type="text/css" href="org-overrides.css" />
</head>
<body>
<div id="content">
<h1 class="title">Searching Delimited Log Files (alternatively, sed is black magic)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#unnumbered-1">The problem</a></li>
<li><a href="#unnumbered-2">Black Magic</a></li>
</ul>
</div>
</div>

<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">The problem</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
Ever find yourself looking through log files that look like this:
</p>

<pre class="example">
-----------
Just a regular log entry
-----------
Another log entry, now
spanning multiple lines
-----------
And all seperated by a series
of dashes.  Though, really, it
could be any sort of seperator.
-----------
Also, we don't necessarily end
with an entry seperator.
</pre>

<p>
Ever wanted to grep for the entry that contains a given piece of
text, but wanted to see the full entry?  That is, if you wanted to
find the entry that had the word "necessarily," but wanted to see
the full entry:
</p>

<pre class="example">
-----------
Also, we don't necessarily end
with an entry seperator.
</pre>

<p>
Odds are there are plenty of tools that do this of which I am not
familiar.  Hopefully someone can find a way to let me know about
them.
</p>

<p>
In the meantime, however, here is a bit of sed black magic that can
accomplish the goal.  I should say that this does have a major
benefit, in that sed is installed everywhere.
</p>
</div>
</div>

<div id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">Black Magic</h2>
<div class="outline-text-2" id="text-unnumbered-2">
<p>
Our goal is fairly simple, we want to invoke sed such that it does
not print out the entire file.  We want to hold all lines that are
not seperators.  And then, at a seperator or the end of the file, we
want to check all of the lines that we have held for our search
pattern, print if found, otherwise delete and continue.
</p>

<div class="org-src-container">

<pre class="src src-sh">sed -n -e <span style="color: #CC9393;">"/^----/!H; /^----/ b test; $ b test; d; : test { x; /necessarily/p }"</span>
</pre>
</div>

<p>
Simply pass the file or the contents of the file to sed however you
want and out come your results.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Josh</p>
<p class="date">Created: 2015-01-07 Wed 21:02</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.0.50.2 (<a href="http://orgmode.org">Org</a> mode 8.3beta)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
